---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyIsParametric
source: html/2012b91d-20eb-f6a0-918a-f980b6ac018a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyIsParametric Property

"Is parametric"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyIsParametric { get; }
```